import matplotlib.pyplot as plt

fig = plt.figure(figsize=(10, 7))
# plot = fig.add_subplot()
# plot.plot([0, 1, 7, 190], [1, 1, 0, 0], marker='+', label='Очень низкая')
# plot.plot([0, 5, 10, 20, 30, 190], [0, 0, 1, 1, 0, 0], marker='v', label='Низкая')
# plot.plot([0, 25, 30, 65, 75, 190], [0, 0, 1, 1, 0, 0], marker='D', label='Средняя')
# plot.plot([0, 70, 80, 115, 125, 190], [0, 0, 1, 1, 0, 0], marker='o', label='Высокая')
# plot.plot([0, 110, 130, 190], [0, 0, 1, 1], marker='s', label='Очень высокая')
# plt.legend()
# plt.grid()
# # plt.title("")
# plt.ylabel("M(v)")
# plt.xlabel("Скорость (v), км/ч")

# plot = fig.add_subplot()
# plot.plot([0, 1, 5, 80], [1, 1, 0, 0], marker='+', label='Очень низкое')
# plot.plot([0, 3, 7, 9, 15, 80], [0, 0, 1, 1, 0, 0], marker='v', label='Низкое')
# plot.plot([0, 9, 15, 24, 80], [0, 0, 1, 0, 0], marker='D', label='Среднее')
# plot.plot([0, 15, 24, 50, 60, 80], [0, 0, 1, 1, 0, 0], marker='o', label='Высокое')
# plot.plot([0, 45, 60, 80], [0, 0, 1, 1], marker='s', label='Очень высокое')
# plt.legend()
# plt.grid()
# # plt.title("")
# plt.ylabel("M(s)")
# plt.xlabel("Расстояние между автомобилями (s), м")

plot = fig.add_subplot()
plot.plot(
    [i for i in range(5, 131)],
    [
        4.37, 5.24, 5.28, 5.75, 6.26, 4.69, 4.37, 3.98, 3.49, 2.86, 1.99, 0.733, 0.1, 0.281, 0.471, 0.675, 5.08, 0.993,
        1.09, 3.44, 3.77, 3.75, 3.64, 3.62, 3.68, 3.5, 3.69, 4.36, 4.21, 4.05, 3.88, 3.71, 3.52, 3.33, 3.12, 2.89, 2.66,
        2.4, 2.13, 1.83, 1.51, 1.16, 0.786, 0.372, 0.0314, 0.21, 0.388, 0.566, 0.745, 0.924, 1.1, 1.28, 1.46, 1.64, 1.82,
        2, 2.18, 2.36, 2.53, 2.71, 2.89, 3.08, 3.26, 3.42, 3.16, 3.27, 3.28, 3.48, 3.28, 5.08, 5.26, 4.92, 5.11, 5.31,
        5.51, 5.7, 5.87, 6.05, 6.24, 6.43, 6.62, 6.81, 7.01, 7.2, 7.4, 7.6, 7.8, 8.01, 8.22, 8.44, 8.69, 9, 9.73, 20.9,
        27.5, 28.9, 29.6, 30.1, 30.6, 31, 31.3, 31.7, 32.1, 32.4, 32.8, 33.2, 33.6, 34, 34.4, 34.8, 35.1, 35.1, 26.7,
        26, 26, 25.5, 25, 24.7, 24.8, 24.9, 24.6, 24.8, 25.3, 25, 10.1, 10.4,
    ],
)
plt.grid()
# plt.title("")
plt.ylabel("СКО расстояния до лидера, м")
plt.xlabel("Скорость лидера, км/ч")

plt.show()
